{"backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 96, "kernel_size": [3, 3], "batch_input_shape": [null, 50, 50, 1], "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 96, "kernel_size": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 96, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 96, "kernel_size": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 96, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 1, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "strides": [1, 1]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "alpha": 0.0010000000474974513, "trainable": true}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwkAAAB8AAALZAEAF1MpAk7pAQAAAKkAKQHaAXhyAgAAAHIC\nAAAA+kMvaG9tZS9sZC1zZ2Rldi96aGloYW9fc3VuL2thZ2dsZS1kZW5vaXNpbmctZGlydHktZG9j\ndW1lbnRzL21vZGVsLnB52gg8bGFtYmRhPjIAAADzAAAAAA==\n", null, null], "output_shape_type": "raw", "name": "lambda_1", "output_shape": null, "arguments": {}, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "alpha": 0.0010000000474974513, "trainable": true}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwkAAAB8AAALZAEAF1MpAk7pAQAAAKkAKQHaAXhyAgAAAHIC\nAAAA+kMvaG9tZS9sZC1zZ2Rldi96aGloYW9fc3VuL2thZ2dsZS1kZW5vaXNpbmctZGlydHktZG9j\ndW1lbnRzL21vZGVsLnB52gg8bGFtYmRhPjQAAADzAAAAAA==\n", null, null], "output_shape_type": "raw", "name": "lambda_2", "output_shape": null, "arguments": {}, "trainable": true}}]}